################################################################################
# before settings
################################################################################

# tap
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'sanemat/font'
tap 'ethereum/ethereum'
tap 'heroku/brew'
tap 'cloudfoundry/tap'

# cask
brew 'cask'

# X11
cask 'xquartz'

################################################################################
# brew install
################################################################################

# git
brew 'git'
brew 'git-flow'
brew 'tig'
brew 'ghq'

# GitHub
brew 'hub'

# signature
brew 'gpg'

# completion
brew 'bash-completion'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'gem-completion'
brew 'pip-completion'
brew 'vagrant-completion'
brew 'spring-completion'
brew 'maven-completion'
brew 'gradle-completion'

# command extension
brew 'vim'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'
brew 'peco'
brew 'trash'
brew 'q'
brew 'ccat'
brew 'telnet'

# json tools
brew 'jsonpp'
brew 'yajl'
brew 'jq'

# terminal extension
brew 'tmux'

# image convertor
brew 'imagemagick'

# font extension
brew 'ricty'

# http server
brew 'httpd'
brew 'nginx'

# DB
brew 'mongodb'
brew 'mysql'
brew 'postgresql'
brew 'redis'

# depend on electron-packager
brew 'wine'

# for react-native
brew 'watchman'

# deploy services
brew 'heroku'
brew 'awscli'
brew 'aws-elasticbeanstalk'

# ci services
brew 'travis'
brew 'circleci'

# driver
brew 'geckodriver'

# DevOps
brew 'ansible'

# Blockchain
brew 'ethereum'
brew 'solidity'

# Protocol buffer
brew 'clang-format'

# program
brew 'haskell-stack'

# Java required
cask 'java'
brew 'tomcat'

####################
# brew cask install
####################

# font
cask 'font-ricty-diminished'

# security
cask '1password'
cask 'avast-security'

# rancher
cask 'alfred'

# swither
cask 'hyperswitch'

# terminal
cask 'iterm2'

# SFTP
cask 'cyberduck'

# git client
cask 'sourcetree'

# browser
cask 'google-chrome'
cask 'firefox'

# driver
cask 'chromedriver'

# program
cask 'r-app'
cask 'processing'
cask 'anaconda'

# free editor and IDE
cask 'sublime-text'
cask 'brackets'
cask 'atom'
cask 'visual-studio-code'
cask 'eclipse-ide'
cask 'springtoolsuite'
cask 'android-studio'
cask 'rstudio'
cask 'expo-xde'

# DB workbench
cask 'mysqlworkbench'
cask 'pgadmin4'

# virtual host
cask 'virtualbox'

# container
cask 'docker'
cask 'kitematic'

# DevOps
cask 'vagrant'

# design tool
cask 'balsamiq-mockups'

# development tools
cask 'robo-3t'
cask 'postman'

# android emulator
cask 'genymotion'

# network debugging
cask 'wireshark'

# cloud storage
cask 'dropbox'

# mobi convertor
cask 'kindle'
cask 'kindlegen'
cask 'calibre'

# social
cask 'evernote'
cask 'skype'
cask 'slack'

# study
cask 'anki'

# openVPN
cask 'tunnelblick'

# Japanese Key Board Support
cask 'cmd-eikana'
cask 'karabiner'

# others
cask 'duet'
cask 'caffeine'
cask 'disk-inventory-x'
cask 'dash'
cask 'flash-player'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'macs-fan-control'
cask 'shiftit'
cask 'skitch'
cask 'gimp'
cask 'the-unarchiver'
cask 'tomighty'
cask 'xmind'
cask 'image2icon'
cask 'clipy'

# paid tools
cask 'intellij-idea'
cask 'marsedit'
cask 'camtasia'
#cask 'snagit'

################################################################################
# mas install
################################################################################

# developer tool
mas 'Xcode', id: 497799835

# apple product
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825

# social
mas 'LINE', id: 539883307

# useful tools
mas 'HiddenMe', id: 467040476

# paid tools
mas 'Affinity Photo', id: 824183456
mas 'MarsEdit', id: 1198319098
