################################################################################
# before settings
################################################################################

# tap
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'sanemat/font'
tap 'ethereum/ethereum'
tap 'heroku/brew'
tap 'cloudfoundry/tap'
tap 'homebrew/cask-versions'

# X11
cask 'xquartz'

################################################################################
# brew install
################################################################################

# git
brew 'git'
brew 'git-flow'
brew 'tig'
brew 'ghq'

# GitHub
brew 'hub'

# signature
brew 'gpg'

# shell
brew 'fish'

# zsh package manager
brew 'zplug'

# completion
brew 'bash-completion'
brew 'zsh-completions'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'gem-completion'
brew 'pip-completion'
brew 'vagrant-completion'
brew 'spring-completion'
brew 'maven-completion'
brew 'gradle-completion'

# command extension
brew 'vim'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'
brew 'peco'
brew 'fzf'
brew 'trash'
brew 'q'
brew 'ccat'
brew 'telnet'
brew 'iproute2mac'
brew 'unar'

# json tools
brew 'jsonpp'
brew 'yajl'
brew 'jq'

# terminal theme
brew 'starship'

# terminal extension
brew 'tmux'

# image convertor
brew 'imagemagick'

# font extension
brew 'ricty'

# http server
brew 'httpd'
brew 'nginx'

# DB
brew 'mongodb'
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'rethinkdb'
brew 'influxdb'
brew 'cassandra'
brew 'couchdb'
brew 'neo4j'

# DB required Java8
brew 'java8'
brew 'hbase'

# Cache
brew 'memcached'

# depend on electron-packager
brew 'wine'

# for react-native
brew 'watchman'

# cloud services
brew 'heroku'
brew 'awscli'
brew 'aws-elasticbeanstalk'
brew 'cf'
brew 'azure-cli'
brew 'wp-cli'
brew 'wp-cli-completion'

# media downloader
brew 'ffmpeg'
brew 'youtube-dl'

# ci services
brew 'travis'
brew 'circleci'

# driver
brew 'geckodriver'

# DevOps
brew 'ansible'

# Kubernetes
brew 'minikube'
brew 'kubectl' # 'kubernetes-cli'と同じ

# Blockchain
brew 'ethereum'
brew 'solidity'

# Protocol buffer
brew 'clang-format'

# program
brew 'haskell-stack'

# Servlet Container required Java
cask 'java'
brew 'tomcat'

####################
# brew cask install
####################

# font
cask 'font-ricty-diminished'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-roboto-mono-for-powerline'

# security
cask '1password'
cask 'avast-security'

# rancher
cask 'alfred'

# swither
cask 'hyperswitch'

# terminal
cask 'iterm2'

# SFTP
cask 'cyberduck'

# git client
cask 'sourcetree'
cask 'gitkraken'
cask 'gitup'
cask 'fork'

# git merge tool
cask 'p4v' # p4merge

# browser
cask 'google-chrome'
cask 'firefox'
cask 'microsoft-edge-canary'

# driver
cask 'chromedriver'

# program
cask 'r-app'
cask 'processing'
cask 'anaconda'

# free editor and IDE
cask 'sublime-text'
cask 'brackets'
cask 'atom'
cask 'visual-studio-code'
cask 'eclipse-jee'
cask 'springtoolsuite'
cask 'android-studio'
cask 'rstudio'
cask 'expo-xde'
cask 'visual-studio'
cask 'mono-mdk' # for visual-studio
cask 'rider'
cask 'typora'
cask 'adobe-acrobat-reader'
cask 'responsively'

# DB workbench
cask 'mysqlworkbench'
cask 'pgadmin4'

# virtual host
cask 'virtualbox'

# container
cask 'docker'
cask 'kitematic'

# cloud services
cask 'google-cloud-sdk'

# DevOps
cask 'vagrant'

# design tool
cask 'balsamiq-mockups'

# development tools
cask 'robo-3t'
cask 'postman'

# android emulator
cask 'genymotion'

# network debugging
cask 'wireshark'

# cloud storage
cask 'dropbox'

# mobi convertor
cask 'kindle'
cask 'kindlegen'

# social
cask 'evernote'
cask 'skype'
cask 'slack'

# study
cask 'anki'

# openVPN
cask 'tunnelblick'

# Japanese Key Board Support
cask 'cmd-eikana'
cask 'karabiner-elements'

# media player
cask 'qlvideo'
cask 'vlc'

# logitech camera
cask 'logitech-camera-settings'

# oculus quest
cask 'sidequest'

# others
cask 'caffeine'
cask 'disk-inventory-x'
cask 'dash'
cask 'flash-player'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'macs-fan-control'
cask 'shiftit'
cask 'skitch'
cask 'gimp'
cask 'the-unarchiver'
cask 'tomighty'
cask 'xmind'
cask 'image2icon'
cask 'clipy'
cask 'funter'
cask 'onyx'
cask 'switchhosts'
cask 'geogebra'

# paid tools
cask 'duet'
cask 'intellij-idea'
cask 'jetbrains-toolbox' # for intellij-idea
cask 'marsedit'
cask 'camtasia'
#cask 'snagit'
cask 'flume'
# cask 'sketch'
cask 'spotify'
cask 'figma'

################################################################################
# mas install
################################################################################

# developer tool
mas 'Xcode', id: 497799835

# apple product
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825

# social
mas 'LINE', id: 539883307

# useful tools
mas 'HiddenMe', id: 467040476

# paid tools
mas 'Affinity Photo', id: 824183456
mas 'MarsEdit', id: 1198319098
