################################################################################
# before settings
################################################################################

# tap
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'sanemat/font'

# cask
brew 'cask'

# X11
cask 'xquartz'

################################################################################
# brew install
################################################################################

# git
brew 'git'
brew 'git-flow'

# signature
brew gpg

# completion
brew 'bash-completion'
brew 'docker-machine-completion'
brew 'gem-completion'
brew 'pip-completion'
brew 'vagrant-completion'

# command extension
brew 'tree'
brew 'watch'
brew 'wget'
brew 'z'
brew 'peco'
brew 'trash'
brew 'q'

# json tools
brew 'jsonpp'
brew 'yajl'

# terminal extension
brew 'tmux'

# image convertor
brew 'imagemagick'

# font extension
brew 'sanemat/font/ricty'

# DB
brew 'mongodb'
brew 'mysql'

####################
# brew cask install
####################

# security
cask '1password'
cask 'avast'

# iTunes extension
cask 'anytrans'

# rancher
cask 'alfred'

# swither
cask 'hyperswitch'

# terminal
cask 'iterm2'

# SFTP
cask 'cyberduck'

# git client
cask 'sourcetree'

# browser
cask 'google-chrome'
cask 'firefox'

# program
cask 'r-app'
cask 'processing'

# editor and IDE
cask 'sublime-text'
cask 'brackets'
cask 'atom'
cask 'visual-studio-code'
cask 'eclipse-ide'
cask 'sts'
cask 'android-studio'
cask 'rstudio'
cask 'intellij-idea-ce'

# virtual host
cask 'virtualbox'
cask 'docker-toolbox'

# design tool
cask 'sketch'

# debugging
cask 'fiddler'
cask 'wireshark'

# cloud storage
cask 'dropbox'

# mobi convertor
cask 'kindle'
cask 'kindlepreviewer'
cask 'calibre'

# social
cask 'evernote'
cask 'skype'
cask 'slack'

# others
cask 'caffeine'
cask 'cheatsheet'
cask 'disk-inventory-x'
cask 'dash'
cask 'flash-player'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'refresh-finder'
cask 'macs-fan-control'
cask 'shiftit'
cask 'karabiner'
cask 'skitch'
cask 'gimp'
cask 'the-unarchiver'
cask 'tomighty'
cask 'xmind'

################################################################################
# mas install
################################################################################

# developer tool
mas 'Xcode', id: 497799835

# apple product
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825

# social
mas 'LINE', id: 539883307

# design tools
mas 'Affinity Photo', id: 824183456
